/*
P2672 [NOIP2015 普及组] 推销员

题目描述
阿明是一名推销员，他奉命到螺丝街推销他们公司的产品。螺丝街是一条死胡同，出口与入口是同一个，街道的一侧是围墙，另一侧是住户。螺丝街一共有 N 家住户，第 i 家住户到入口的距离为 Si 米。由于同一栋房子里可以有多家住户，所以可能有多家住户与入口的距离相等。阿明会从入口进入，依次向螺丝街的 X 家住户推销产品，然后再原路走出去。

阿明每走 1 米就会积累 1 点疲劳值，向第 i 家住户推销产品会积累 Ai 点疲劳值。阿明是工作狂，他想知道，对于不同的 X，在不走多余的路的前提下，他最多可以积累多少点疲劳值。

输入格式
第一行有一个正整数 N，表示螺丝街住户的数量。
接下来的一行有 N 个正整数，其中第 i 个整数 Si 表示第 i 家住户到入口的距离。数据保证 S1 ≤ S2 ≤ ⋯ ≤ Sn <10^8。
接下来的一行有 N 个正整数，其中第 i 个整数 Ai 表示向第 i 户住户推销产品会积累的疲劳值。数据保证 Ai < 1000。

输出格式
输出 N 行，每行一个正整数，第 i 行整数表示当 X = i 时，阿明最多积累的疲劳值。
*/

#include <bits/stdc++.h>
using namespace std;

int main()
{
    
}