/*
日志分析
题目描述
M 海运公司最近要对旗下仓库的货物进出情况进行统计。目前他们所拥有的唯一记录就是一个记录集装箱进出情况的日志。该日志记录了两类操作：第一类操作为集装箱入库操作，以及该次入库的集装箱重量；第二类操作为集装箱的出库操作。这些记录都严格按时间顺序排列。集装箱入库和出库的规则为先进后出，即每次出库操作出库的集装箱为当前在仓库里所有集装箱中最晚入库的集装箱。

出于分析目的，分析人员在日志中随机插入了若干第三类操作――查询操作。分析日志时，每遇到一次查询操作，都要报告出当前仓库中最大集装箱的重量。

输入格式
包含 N+1 行：
第一行为一个正整数 N，对应于日志内所含操作的总数。
接下来的 N 行，分别属于以下三种格式之一：

格式 1：0 X，表示一次集装箱入库操作，正整数 X 表示该次入库的集装箱的重量。
格式 2：1，表示一次集装箱出库操作，（就当时而言）最后入库的集装箱出库。
格式 3：2，表示一次查询操作，要求分析程序输出当前仓库内最大集装箱的重量。
当仓库为空时你应该忽略出库操作，当仓库为空查询时你应该输出 0。

输出格式
输出行数等于日志中查询操作的次数。每行为一个整数，表示查询结果。
*/

#include <bits/stdc++.h>
using namespace std;

const int N = 1e7;
int a[N];
int m = 0;

int main()
{
    int n; cin >> n;
    int top = 0;
    for (int i = 1; i <= n; i++)
    {
        int act; cin >> act;
        if (act == 0)
        {
            int x; cin >> x;
            a[++top] = x;
            m = max(m, x); 
        }
        else if (act == 1 && top >= 1)
        {
            if (m == a[top])
            {
                m = 0;
                for (int j = 1; j < top; j++)
                {
                    m = max(m, a[j]);
                }
            }
            top--;
        }
        else if (act == 2)
        {
            cout << m << endl;
        }
    }
    
    return 0;
}